УТ114.sprut/src/InformationRegisters/sprt_СопоставлениеКлиентов/sprt_СопоставлениеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>sprt_СопоставлениеКлиентов</name>
  <resources>
    <name>ПартнерИзБазы</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>ПартнерИзОтчета</name>
    <type>
      <types>CatalogRef.sprt_ПартнерыИзОтчетов</types>
    </type>
  </resources>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ114.sprut/src/InformationRegisters/sprt_СопоставлениеКлиентов/ManagerModule.bsl
Процедура ЗаполнитьОтсутствующимиПартнерамиИзФайлов () Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
		|	sprt_ПартнерыИзОтчетов.Ссылка КАК ПартнерИзОтчета
		|ИЗ
		|	Справочник.sprt_ПартнерыИзОтчетов КАК sprt_ПартнерыИзОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.sprt_СопоставлениеКлиентов КАК sprt_СопоставлениеКлиентов
		|		ПО sprt_СопоставлениеКлиентов.ПартнерИзОтчета = sprt_ПартнерыИзОтчетов.Ссылка
		|ГДЕ
		|	sprt_СопоставлениеКлиентов.ПартнерИзБазы ЕСТЬ NULL");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.sprt_СопоставлениеКлиентов.СоздатьМенеджерЗаписи();
		Запись.КлючЗаписи = Новый УникальныйИдентификатор();
		Запись.Активно = Истина;
		Запись.ПартнерИзОтчета = Выборка.ПартнерИзОтчета;
		Запись.Записать();
		
	КонецЦикла;
	

КонецПроцедуры
